In [143]:
import pandas as pd
import numpy as np
import datetime
import random

In [179]:
data = pd.read_csv("new.csv")

In [180]:
print(data.head())

   Sl no     Name  gender  age  salary  spend
0      1     Alif    Male   21   10000   8000
1      2    Rafik    Male   26   15000  10000
2      3  Sumaiya  Female   25   18000  15000
3      4     blif    Male   28   19000  14000
4      5    Kafik    Male   26   20000  18000

In [146]:
print (data['gender'])

0      Male
1      Male
2    Female
3      Male
4      Male
5    Female
Name: gender, dtype: object

In [147]:
print(f"No of Male is : {len(data[data['gender'] == 'Male'])}")
print(f"No of Female is : {len(data[data['gender'] == 'Female'])}")

No of Male is : 4
No of Female is : 2

In [149]:
print("The max age is: ",data ['age'][data['age'].idxmax()])
print("The min age is: ",data ['age'][data['age'].idxmin()])

The max age is:  36
The min age is:  21

In [176]:
print("The age of 21-26 are \n ",data ['age'][data['age'].between(21,26)])

The age of 21-26 are
  0    21
1    26
2    25
4    26
Name: age, dtype: int64

In [183]:
data.head()

   Sl no     Name  gender  age  salary  spend
0      1     Alif    Male   21   10000   8000
1      2    Rafik    Male   26   15000  10000
2      3  Sumaiya  Female   25   18000  15000
3      4     blif    Male   28   19000  14000
4      5    Kafik    Male   26   20000  18000

In [187]:
data['gender']
salary_ratio = data['salary']/ data['spend']
print(salary_ratio)

0    1.250000
1    1.500000
2    1.200000
3    1.357143
4    1.111111
5    1.136364
dtype: float64

In [204]:
print("Salary Ratio of Male is : ",data['gender'])

Salary Ratio of Male is :  0      Male
1      Male
2    Female
3      Male
4      Male
5    Female
Name: gender, dtype: object